# Data Preparation

In [4]:
# Necessary Imports

import numpy as np
import pandas as pd

# Will add more imports here later

In [20]:
file_name = "resale-flat-prices-based-on-registration-date-from-jan-2017-onwards"

#absolute_path = os.path.abspath(os.path.dirname('data.csv'))
#print(absolute_path)

df = pd.read_csv('../dataset/sale-prediction/resale-flat-prices-based-on-registration-date-from-jan-2017-onwards.csv')
df.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,remaining_lease,resale_price
0,2017-01,ANG MO KIO,2 ROOM,406,ANG MO KIO AVE 10,10 TO 12,44.0,Improved,1979,61 years 04 months,232000.0
1,2017-01,ANG MO KIO,3 ROOM,108,ANG MO KIO AVE 4,01 TO 03,67.0,New Generation,1978,60 years 07 months,250000.0
2,2017-01,ANG MO KIO,3 ROOM,602,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,262000.0
3,2017-01,ANG MO KIO,3 ROOM,465,ANG MO KIO AVE 10,04 TO 06,68.0,New Generation,1980,62 years 01 month,265000.0
4,2017-01,ANG MO KIO,3 ROOM,601,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,265000.0

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 97717 entries, 0 to 97716
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   month                97717 non-null  object
 1   town                 97717 non-null  object
 2   flat_type            97717 non-null  object
 3   block                97717 non-null  object
 4   street_name          97717 non-null  object
 5   storey_range         97717 non-null  object
 6   floor_area_sqm       97717 non-null  float64
 7   flat_model           97717 non-null  object
 8   lease_commence_date  97717 non-null  int64
 9   remaining_lease      97717 non-null  object
 10  resale_price         97717 non-null  float64
dtypes: float64(2), int64(1), object(8)
memory usage: 8.2+ MB

In [22]:
df.describe()

       floor_area_sqm  lease_commence_date  resale_price
count    97717.000000         97717.000000  9.771700e+04
mean        97.779138          1994.620475  4.479384e+05
std         24.222591            13.163791  1.557166e+05
min         31.000000          1966.000000  1.400000e+05
25%         82.000000          1984.000000  3.350000e+05
50%         95.000000          1995.000000  4.180000e+05
75%        113.000000          2004.000000  5.250000e+05
max        249.000000          2019.000000  1.258000e+06